package pers.wuliang.robot.core.common

object Constant {
    const val SUCCESS_CODE = 200
    const val CODE = "code"
    const val PYTHON = "python"
    const val HELP = "[无量姬的指令]\n" +
            "一、含参指令\n" +
            "1.【天气查询】 : /tq 城市\n(别名:XX天气)\n\n" +
            "2.【地理查询】 : /dl 城市\n(别名:XX地理)\n\n" +
            "3.【群友互动】: 后接@人\n " +
            "   ①/丢   ②/拍   ③/抓\n" +
            "    ④/抱   ⑤/锤\n\n" +
            "4.【抽卡分析】 : 原神抽卡分析 复制到的抽卡链接\n\n" +
            "5.【可达鸭】 : 可达鸭 左侧文字 右侧文字\n\n" +
            "6.【来点涩图】 : 来点[你的xp]涩图\n\n" +
            "二、无参指令\n" +
            "1.【青年大学习】:\n查看当期青年大学习问题与答案\n\n" +
            "2.【来点好康的】:\n阿姬的珍藏品~\n\n" +
            "3.【来点原神】:\n阿姬的原神图片\n\n" +
            "3.【看看动漫】:\n阿姬是个二刺螈\n\n" +
            "4.【原神相关指令】:\n输入“/原神帮助”以获得详细信息\n" +
            "   含原神抽卡分析，原神米游社自动签到等指令"
}